app/controllers/comments_controller.rb

 def create
  @product = Product.find(params[:product_id])
  @comment = @product.comments.new(comment_params)
  @comment.user = current_user
  @user = current_user
  respond_to do |format|
      if @comment.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["body", "hkjhk"], ["rating", 4], ["product_id", 1], ["created_at", 2016-10-13 15:45:54 UTC], ["updated_at", 2016-10-13 15:45:54 UTC]]