app/controllers/payment_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "orders" DEFAULT VALUES
---
def create
    @product.id = Product.find(params[:product_id])
    @payment.user = current_user
    # Create the charge on Stripe's servers - this will charge the user's card
  begin
    charge = Stripe::Charge.create(
      :amount => 1000, # amount in cents, again
      :currency => "Euro",
      :source => "http://careerfoundry.com/images/bike.jpg",
      :description => params[:stripeEmail]
    )
  end

    if charge.paid
      Order.create(:user_id, :product_id)