app/controllers/products_controller.rb

def index
  if params[:q]
    search_term = params[:q]
    @products = Product.where("name LIKE ?", "%#{search_term}%")
  else
    @products = Product.all
---
SELECT "products".* FROM "products" WHERE (name LIKE '%hello%')
SELECT "products".* FROM "products"

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "image_url" = ?, "colour" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "http://static.tvtropes.org/pmwiki/pub/images/Hello_Kitty_Pink_2981.jpg"], ["colour", ""], ["price", ""], ["updated_at", 2016-10-13 16:18:39 UTC], ["id", 2]]