app/controllers/static_pages_controller.rb

SELECT  "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
	def landing_page
 		@featured_product = Product.first